import img from '../../images/adaptive.png';
import styles from './styles.module.css';

const Adaptive = () => {
  return (
    <div className={styles.adaptive}>
      <div className={styles.description}>
        <h2>3. Адаптивна верстка</h2>

        <p>
          <strong>Адаптивна верстка</strong> дуже близька до респонсів (див.
          нижче) і заснована на використанні медіа-запитів для адаптації
          контенту під різні пристрої та параметри екранів. Причому робиться це
          динамічно, без дії користувача.
        </p>

        <p>
          Основна відмінність даної верстки від респонсів полягає в тому, що при
          даному типі верстки сторінка «стрибає» за заздалегідь заданими
          (контрольними) точками, адаптуючи контент щоразу до найбільш
          підходящої та найближчої з них. Іншими словами, медіа-запити описують
          фіксовані положення контенту кожної з цих точок. Зрештою виходить
          набір з кількох фіксованих макетів, які працюють з різними дозволами
          екранів.
        </p>

        <p>
          <strong>Плюси:</strong> при комбінуванні даного типу верстки з
          гумовою, можна налаштувати відображення сайту, починаючи від найменших
          дозволів мобільних пристроїв, і закінчуючи найбільшими моніторами.
        </p>

        <p>
          <strong>Мінуси:</strong> Досить важко передбачити, як виглядатиме сайт
          абсолютно на всіх пристроях, враховуючи, що відстані між контрольними
          точками можуть бути досить великими.
        </p>
      </div>

      <img className={styles.img} src={img} alt='sample pic' />
    </div>
  );
};

export default Adaptive;
