import Link from '@mui/material/Link';
import styles from './styles.module.css';

const Home = () => (
  <div className={styles.home}>
    <Link
      href='https://github.com/GregorHorvatH/design-types'
      target='_blank'
      rel='noreferrer'
    >
      https://github.com/GregorHorvatH/design-types
    </Link>

    <p>
      <strong>Фіксована верстка</strong> — тип верстки, при якому ширина
      контенту жорстко заданий у пікселях і не змінюється залежно від розміри
      вікна браузера.
    </p>
    <p>
      <strong>Гумова верстка</strong> сайту відрізняється від фіксованої верстки
      відносними розмірами елементів веб-сторінки (у відсотковому
      співвідношенні). Тобто, при гумовій верстці веб-сторінка змінює розміри в
      залежності від ширини вікна браузера. У результаті виходить, що зі
      збільшенням ширини контейнера-батька відбувається збільшення ширини
      елемента сторінки, а при зменшенні ширини контейнера-батька відбувається
      зменшення ширини елемента сторінки. Звідси і з'явилася її назва «гумова».
    </p>
    <p>
      <strong>Адаптивна верстка</strong> дуже близька до респонсів або
      відзивчивого (див. далі) і заснована на використанні медіа-запитів для
      адаптації контенту під різні пристрої та параметри екранів. Причому
      робиться це динамічно, без дії користувача.
    </p>
    <p>
      <strong>Респонсивну (відзивчиву)</strong> часто плутають з адаптивною, але
      на відміну від останньої, ґрунтується на принципі «гуми», але так само як
      і вона використовують медіа-запити для адаптації сайту під ширину
      пристрою. Якщо в адаптивній верстці при зміні розмірів вікна зовнішній
      вигляд сайту змінюється кілька разів, залежно від контрольних точок, то в
      респонсивній верстці він змінюється постійно.
    </p>

    <Link
      href='https://v4.mui.com/ru/guides/responsive-ui/'
      target='_blank'
      rel='noreferrer'
      underline='none'
    >
      <h4>Material UI</h4>
    </Link>
    <p>
      <strong>Grid:</strong> Адаптивна сітка макетів Material Design
      підлаштовується під розмір та орієнтацію екрану, забезпечуючи узгодженість
      макетів.
    </p>
    <p>
      <strong>Container:</strong> Контейнер центрує ваш контент по горизонталі.
      Це є базовим елементом усіх макетів.
    </p>
    <p>
      <strong>Breakpoints:</strong> API, що дозволяє використовувати контрольні
      точки у широкому діапазоні контекстів.
    </p>
    <p>
      <strong>useMediaQuery:</strong> Це хук медіа-запиту для React. Він
      відстежує збіги з медіа-запитом CSS.
    </p>
    <p>
      <strong>Hidden:</strong> Швидко та оперативно керує видимістю компонентів.
    </p>
  </div>
);

export default Home;
